{
  "lastUpdated": "2026-02-26T11:27:45.293Z",
  "itemCount": 20,
  "items": [
    {
      "title": "US Sanctions Russian Exploit Broker Operation Zero",
      "link": "https://www.securityweek.com/us-sanctions-russian-exploit-broker-operation-zero/",
      "pubDate": "2026-02-26T10:33:53.000Z",
      "description": "The broker acquired eight zero-day exploits from a US defense contractor executive jailed for his actions. The post US Sanctions Russian Exploit Broker Operation Zero appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Malicious StripeApi NuGet Package Mimicked Official Library and Stole API Tokens",
      "link": "https://thehackernews.com/2026/02/malicious-stripeapi-nuget-package.html",
      "pubDate": "2026-02-26T10:09:00.000Z",
      "description": "Cybersecurity researchers have disclosed details of a new malicious package discovered on the NuGet Gallery, impersonating a library from financial services firm Stripe in an attempt to target the financial sector. The package, codenamed StripeApi.Net, attempts to masquerade as Stripe.net, a legitim",
      "source": "The Hacker News"
    },
    {
      "title": "Trend Micro Patches Critical Apex One Vulnerabilities",
      "link": "https://www.securityweek.com/trend-micro-patches-critical-apex-one-vulnerabilities/",
      "pubDate": "2026-02-26T09:56:46.000Z",
      "description": "TrendAI has fixed eight critical and high-severity issues in Windows and macOS endpoint security products. The post Trend Micro Patches Critical Apex One Vulnerabilities appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Cisco Patches Catalyst SD-WAN Zero-Day Exploited by Highly Sophisticated Hackers",
      "link": "https://www.securityweek.com/cisco-patches-catalyst-sd-wan-zero-day-exploited-by-highly-sophisticated-hackers/",
      "pubDate": "2026-02-26T09:18:43.000Z",
      "description": "Already added to CISA’s KEV catalog, the flaw allows attackers to bypass authentication and gain administrative privileges. The post Cisco Patches Catalyst SD-WAN Zero-Day Exploited by Highly Sophisticated Hackers appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Cisco SD-WAN Zero-Day CVE-2026-20127 Exploited Since 2023 for Admin Access",
      "link": "https://thehackernews.com/2026/02/cisco-sd-wan-zero-day-cve-2026-20127.html",
      "pubDate": "2026-02-26T06:13:00.000Z",
      "description": "A newly disclosed maximum-severity security flaw in Cisco Catalyst SD-WAN Controller (formerly vSmart) and Catalyst SD-WAN Manager (formerly vManage) has come under active exploitation in the wild as part of malicious activity that dates back to 2023. The vulnerability, tracked as CVE-2026-20127 (CV",
      "source": "The Hacker News"
    },
    {
      "title": "Critical Cisco SD-WAN bug exploited in zero-day attacks since 2023",
      "link": "https://www.bleepingcomputer.com/news/security/critical-cisco-sd-wan-bug-exploited-in-zero-day-attacks-since-2023/",
      "pubDate": "2026-02-25T18:01:51.000Z",
      "description": "Cisco is warning that a critical authentication bypass vulnerability in Cisco Catalyst SD-WAN, tracked as CVE-2026-20127, was actively exploited in zero-day attacks that allowed remote attackers to compromise controllers and add malicious rogue peers to targeted networks. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Google Disrupts UNC2814 GRIDTIDE Campaign After 53 Breaches Across 42 Countries",
      "link": "https://thehackernews.com/2026/02/google-disrupts-unc2814-gridtide.html",
      "pubDate": "2026-02-25T17:46:00.000Z",
      "description": "Google on Wednesday disclosed that it worked with industry partners to disrupt the infrastructure of a suspected China-nexus cyber espionage group tracked as UNC2814 that breached at least 53 organizations across 42 countries. \"This prolific, elusive actor has a long history of targeting internation",
      "source": "The Hacker News"
    },
    {
      "title": "Chinese cyberspies breached dozens of telecom firms, govt agencies",
      "link": "https://www.bleepingcomputer.com/news/security/chinese-cyberspies-breached-dozens-of-telecom-firms-govt-agencies/",
      "pubDate": "2026-02-25T17:00:15.000Z",
      "description": "Google's Threat Intelligence Group (GTIG), Mandiant, and partners disrupted a global espionage campaign attributed to a suspected Chinese threat actor that used SaaS API calls to hide malicious traffic in attacks targeting telecom and government networks. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Claude Code Flaws Allow Remote Code Execution and API Key Exfiltration",
      "link": "https://thehackernews.com/2026/02/claude-code-flaws-allow-remote-code.html",
      "pubDate": "2026-02-25T17:00:00.000Z",
      "description": "Cybersecurity researchers have disclosed multiple security vulnerabilities in Anthropic's Claude Code, an artificial intelligence (AI)-powered coding assistant, that could result in remote code execution and theft of API credentials. \"The vulnerabilities exploit various configuration mechanisms, inc",
      "source": "The Hacker News"
    },
    {
      "title": "The Blast Radius Problem: Stolen Credentials Are Weaponizing Agentic AI",
      "link": "https://www.securityweek.com/the-blast-radius-problem-stolen-credentials-are-weaponizing-agentic-ai/",
      "pubDate": "2026-02-25T16:16:40.000Z",
      "description": "More than half (56%) of the 400,000 vulnerabilities IBM X-Force tracked in 2025 required no authentication before exploitation. The post The Blast Radius Problem: Stolen Credentials Are Weaponizing Agentic AI appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Marquis sues SonicWall over backup breach that led to ransomware attack",
      "link": "https://www.bleepingcomputer.com/news/security/marquis-sues-sonicwall-over-backup-breach-that-led-to-ransomware-attack/",
      "pubDate": "2026-02-25T15:54:44.000Z",
      "description": "Marquis Software Solutions has filed a lawsuit against SonicWall, accusing the cybersecurity company of gross negligence and misrepresentation that allegedly led to a ransomware attack disrupting operations at 74 U.S. banks. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "SolarWinds Patches Four Critical Serv-U Vulnerabilities",
      "link": "https://www.securityweek.com/solarwinds-patches-four-critical-serv-u-vulnerabilities/",
      "pubDate": "2026-02-25T15:30:00.000Z",
      "description": "The four security defects could be exploited for remote code execution but require administrative privileges. The post SolarWinds Patches Four Critical Serv-U Vulnerabilities appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "The OpenClaw Hype: Analysis of Chatter from Open-Source Deep and Dark Web",
      "link": "https://www.bleepingcomputer.com/news/security/the-openclaw-hype-analysis-of-chatter-from-open-source-deep-and-dark-web/",
      "pubDate": "2026-02-25T15:01:11.000Z",
      "description": "OpenClaw has sparked heavy Telegram and dark web chatter, but Flare's data shows more research hype than mass exploitation. Flare explains how its telemetry found real supply-chain risk in the skills marketplace, yet limited signs of large-scale criminal operationalization. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Ex-US Defense Contractor Executive Jailed for Selling Exploits to Russia",
      "link": "https://www.securityweek.com/ex-us-defense-contractor-executive-jailed-for-selling-exploits-to-russia/",
      "pubDate": "2026-02-25T12:59:30.000Z",
      "description": "Peter Williams was sentenced to 87 months in prison for selling cyber exploits to a Russian broker. The post Ex-US Defense Contractor Executive Jailed for Selling Exploits to Russia appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Zyxel warns of critical RCE flaw affecting over a dozen routers",
      "link": "https://www.bleepingcomputer.com/news/security/zyxel-warns-of-critical-rce-flaw-affecting-over-a-dozen-routers/",
      "pubDate": "2026-02-25T12:53:02.000Z",
      "description": "Taiwan networking provider Zyxel has released security updates to address a critical vulnerability affecting over a dozen router models that can allow unauthenticated attackers to gain remote command execution on unpatched devices. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "CarGurus Data Breach Impacts Over 12 Million Users",
      "link": "https://www.securityweek.com/over-12-million-users-impacted-by-cargurus-data-breach/",
      "pubDate": "2026-02-25T12:30:00.000Z",
      "description": "Hackers claim to have stolen personally identifiable information and internal corporate data from the automotive firm. The post CarGurus Data Breach Impacts Over 12 Million Users appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "US sanctions Russian broker for buying stolen zero-day exploits",
      "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-russian-exploit-broker-for-buying-stolen-zero-days/",
      "pubDate": "2026-02-25T10:31:13.000Z",
      "description": "The U.S. Treasury Department has sanctioned a Russian exploit broker who bought stolen hacking tools from a former executive of a U.S. defense contractor. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Defense Contractor Employee Jailed for Selling 8 Zero-Days to Russian Broker",
      "link": "https://thehackernews.com/2026/02/defense-contractor-employee-jailed-for.html",
      "pubDate": "2026-02-25T08:49:00.000Z",
      "description": "A 39-year-old Australian national who was previously employed at U.S. defense contractor L3Harris has been sentenced to a little over seven years in prison for selling eight zero-day exploits to Russian exploit broker Operation Zero in exchange for millions of dollars. Peter Williams pleaded guilty ",
      "source": "The Hacker News"
    },
    {
      "title": "Ex-L3Harris exec jailed for selling zero-days to Russian exploit broker",
      "link": "https://www.bleepingcomputer.com/news/security/ex-l3harris-exec-jailed-for-selling-zero-days-to-russian-exploit-broker/",
      "pubDate": "2026-02-25T08:21:40.000Z",
      "description": "The former head of Trenchant, a specialized U.S. defense contractor unit, was sentenced Tuesday to more than seven years in federal prison for stealing and selling zero-day exploits to a Russian broker whose clients include the Russian government. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "SolarWinds Patches 4 Critical Serv-U 15.5 Flaws Allowing Root Code Execution",
      "link": "https://thehackernews.com/2026/02/solarwinds-patches-4-critical-serv-u.html",
      "pubDate": "2026-02-25T07:04:00.000Z",
      "description": "SolarWinds has released updates to address four critical security flaws in its Serv-U file transfer software that, if successfully exploited, could result in remote code execution. The vulnerabilities, all rated 9.1 on the CVSS scoring system, are listed below - CVE-2025-40538 - A broken access cont",
      "source": "The Hacker News"
    }
  ]
}