{
  "lastUpdated": "2026-02-24T18:10:33.645Z",
  "itemCount": 20,
  "items": [
    {
      "title": "CarGurus data breach exposes information of 12.4 million accounts",
      "link": "https://www.bleepingcomputer.com/news/security/cargurus-data-breach-exposes-information-of-124-million-accounts/",
      "pubDate": "2026-02-24T18:08:20.000Z",
      "description": "The ShinyHunters extortion group has published personal information in more than 12 million records allegedly stolen from CarGurus, a U.S.-based digital auto platform. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Identity-First AI Security: Why CISOs Must Add Intent to the Equation",
      "link": "https://www.bleepingcomputer.com/news/security/identity-first-ai-security-why-cisos-must-add-intent-to-the-equation/",
      "pubDate": "2026-02-24T15:02:12.000Z",
      "description": "AI agents now provision infrastructure and approve actions, but many inherit over-scoped privileges without proper governance. Token Security explains why CISOs must treat agents as identities and add intent-based controls so access is granted only when purpose and context align. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "VMware Aria Operations Vulnerability Could Allow Remote Code Execution",
      "link": "https://www.securityweek.com/vmware-aria-operations-vulnerability-could-allow-remote-code-execution/",
      "pubDate": "2026-02-24T14:30:00.000Z",
      "description": "Broadcom has patched several vulnerabilities in VMware Aria Operations, including high-severity flaws. The post VMware Aria Operations Vulnerability Could Allow Remote Code Execution appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Taiwan Security Firm Confirms Flaw Flagged by CISA Likely Exploited by Chinese APTs",
      "link": "https://www.securityweek.com/taiwan-security-firm-confirms-flaw-flagged-by-cisa-likely-exploited-by-chinese-apt/",
      "pubDate": "2026-02-24T12:00:51.000Z",
      "description": "The vulnerability in TeamT5 ThreatSonar Anti-Ransomware was recently added to CISA’s KEV catalog. The post Taiwan Security Firm Confirms Flaw Flagged by CISA Likely Exploited by Chinese APTs appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "ShinyHunters extortion gang claims Odido breach affecting millions",
      "link": "https://www.bleepingcomputer.com/news/security/shinyhunters-extortion-gang-claims-odido-breach-affecting-millions/",
      "pubDate": "2026-02-24T11:40:20.000Z",
      "description": "The ShinyHunters extortion gang has claimed responsibility for breaching Dutch telecommunications provider Odido and stealing millions of user records from its compromised systems. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Android mental health apps with 14.7M installs filled with security flaws",
      "link": "https://www.bleepingcomputer.com/news/security/android-mental-health-apps-with-147m-installs-filled-with-security-flaws/",
      "pubDate": "2026-02-23T22:59:04.000Z",
      "description": "Several mental health mobile apps with millions of downloads on Google Play contain security vulnerabilities that could expose users' sensitive medical information. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "APT28 Targeted European Entities Using Webhook-Based Macro Malware",
      "link": "https://thehackernews.com/2026/02/apt28-targeted-european-entities-using.html",
      "pubDate": "2026-02-23T19:41:00.000Z",
      "description": "The Russia-linked state-sponsored threat actor tracked as APT28 has been attributed to a new campaign targeting specific entities in Western and Central Europe. The activity, per S2 Grupo's LAB52 threat intelligence team, was active between September 2025 and January 2026. It has been codenamed Oper",
      "source": "The Hacker News"
    },
    {
      "title": "Ad tech firm Optimizely confirms data breach after vishing attack",
      "link": "https://www.bleepingcomputer.com/news/security/ad-tech-firm-optimizely-confirms-data-breach-after-vishing-attack/",
      "pubDate": "2026-02-23T18:04:01.000Z",
      "description": "New York-based ad tech company Optimizely has notified an undisclosed number of customers of a data breach after threat actors compromised some of its systems in a voice phishing attack. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Wormable XMRig Campaign Uses BYOVD Exploit and Time-Based Logic Bomb",
      "link": "https://thehackernews.com/2026/02/wormable-xmrig-campaign-uses-byovd.html",
      "pubDate": "2026-02-23T17:59:00.000Z",
      "description": "Cybersecurity researchers have disclosed details of a new cryptojacking campaign that uses pirated software bundles as lures to deploy a bespoke XMRig miner program on compromised hosts. \"Analysis of the recovered dropper, persistence triggers, and mining payload reveals a sophisticated, multi-stage",
      "source": "The Hacker News"
    },
    {
      "title": "US Healthcare Diagnostic Firm Says 140,000 Affected by Data Breach",
      "link": "https://www.securityweek.com/us-healthcare-diagnostic-firm-says-140000-affected-by-data-breach/",
      "pubDate": "2026-02-23T15:35:32.000Z",
      "description": "The Everest ransomware group has taken credit for a hacker attack on Vikor Scientific, now called Vanta Diagnostics. The post US Healthcare Diagnostic Firm Says 140,000 Affected by Data Breach appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "When identity isn’t the weak link, access still is",
      "link": "https://www.bleepingcomputer.com/news/security/when-identity-isnt-the-weak-link-access-still-is/",
      "pubDate": "2026-02-23T15:00:10.000Z",
      "description": "Stolen tokens and compromised devices let attackers reuse trust without breaking authentication. Specops Software explains why identity alone isn't enough and how continuous device verification strengthens Zero Trust. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "How Exposed Endpoints Increase Risk Across LLM Infrastructure",
      "link": "https://thehackernews.com/2026/02/how-exposed-endpoints-increase-risk.html",
      "pubDate": "2026-02-23T11:58:00.000Z",
      "description": "As more organizations run their own Large Language Models (LLMs), they are also deploying more internal services and Application Programming Interfaces (APIs) to support those models. Modern security risks are being introduced less from the models themselves and more from the infrastructure that ser",
      "source": "The Hacker News"
    },
    {
      "title": "CISA: Recently patched RoundCube flaws now exploited in attacks",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-recently-patched-roundcube-flaws-now-exploited-in-attacks/",
      "pubDate": "2026-02-23T11:44:21.000Z",
      "description": "CISA flagged two Roundcube Webmail vulnerabilities as actively exploited in attacks and ordered U.S. federal agencies to patch them within three weeks. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Malicious npm Packages Harvest Crypto Keys, CI Secrets, and API Tokens",
      "link": "https://thehackernews.com/2026/02/malicious-npm-packages-harvest-crypto.html",
      "pubDate": "2026-02-23T10:20:00.000Z",
      "description": "Cybersecurity researchers have disclosed what they say is an active \"Shai-Hulud-like\" supply chain worm campaign that has leveraged a cluster of at least 19 malicious npm packages to enable credential harvesting and cryptocurrency key theft. The campaign has been codenamed SANDWORM_MODE by supply ch",
      "source": "The Hacker News"
    },
    {
      "title": "Anthropic Launches Claude Code Security for AI-Powered Vulnerability Scanning",
      "link": "https://thehackernews.com/2026/02/anthropic-launches-claude-code-security.html",
      "pubDate": "2026-02-21T07:58:00.000Z",
      "description": "Artificial intelligence (AI) company Anthropic has begun to roll out a new security feature for Claude Code that can scan a user's software codebase for vulnerabilities and suggest patches. The capability, called Claude Code Security, is currently available in a limited research preview to Enterpris",
      "source": "The Hacker News"
    },
    {
      "title": "CISA Adds Two Actively Exploited Roundcube Flaws to KEV Catalog",
      "link": "https://thehackernews.com/2026/02/cisa-adds-two-actively-exploited.html",
      "pubDate": "2026-02-21T07:21:00.000Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added two security flaws impacting Roundcube webmail software to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation. The vulnerabilities in question are listed below - CVE-2025-49113 (CV",
      "source": "The Hacker News"
    },
    {
      "title": "EC-Council Expands AI Certification Portfolio to Strengthen U.S. AI Workforce Readiness and Security",
      "link": "https://thehackernews.com/2026/02/ec-council-expands-ai-certification.html",
      "pubDate": "2026-02-21T04:30:00.000Z",
      "description": "With $5.5 trillion in global AI risk exposure and 700,000 U.S. workers needing reskilling, four new AI certifications and Certified CISO v4 help close the gap between AI adoption and workforce readiness. EC-Council, creator of the world-renowned Certified Ethical Hacker (CEH) credential and a global",
      "source": "The Hacker News"
    },
    {
      "title": "BeyondTrust Flaw Used for Web Shells, Backdoors, and Data Exfiltration",
      "link": "https://thehackernews.com/2026/02/beyondtrust-flaw-used-for-web-shells.html",
      "pubDate": "2026-02-20T15:45:00.000Z",
      "description": "Threat actors have been observed exploiting a recently disclosed critical security flaw impacting BeyondTrust Remote Support (RS) and Privileged Remote Access (PRA) products to conduct a wide range of malicious actions, including deploying VShell and The vulnerability, tracked as CVE-2026-1731 (CVSS",
      "source": "The Hacker News"
    },
    {
      "title": "Identity Cyber Scores: The New Metric Shaping Cyber Insurance in 2026",
      "link": "https://thehackernews.com/2026/02/identity-cyber-scores-new-metric.html",
      "pubDate": "2026-02-20T10:30:00.000Z",
      "description": "With one in three cyber-attacks now involving compromised employee accounts, insurers and regulators are placing far greater emphasis on identity posture when assessing cyber risk. For many organizations, however, these assessments remain largely opaque. Elements such as password hygiene, privileged",
      "source": "The Hacker News"
    },
    {
      "title": "Microsoft Patches CVE-2026-26119 Privilege Escalation in Windows Admin Center",
      "link": "https://thehackernews.com/2026/02/microsoft-patches-cve-2026-26119.html",
      "pubDate": "2026-02-19T17:40:00.000Z",
      "description": "Microsoft has disclosed a now-patched security flaw in Windows Admin Center that could allow an attacker to escalate their privileges. Windows Admin Center is a locally deployed, browser-based management tool set that lets users manage their Windows Clients, Servers, and Clusters without the need fo",
      "source": "The Hacker News"
    }
  ]
}