{
  "lastUpdated": "2026-02-27T16:59:10.102Z",
  "itemCount": 20,
  "items": [
    {
      "title": "CISA warns that RESURGE malware can be dormant on Ivanti devices",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-that-resurge-malware-can-be-dormant-on-ivanti-devices/",
      "pubDate": "2026-02-27T15:57:04.000Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released new details about RESURGE, a malicious implant used in zero-day attacks exploiting CVE-2025-0282 to breach Ivanti Connect Secure devices. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "In Other News: ATT&#038;CK Advisory Council, Russian Cyberattacks Aid Missile Strikes, Predator Bypasses iOS Indicators",
      "link": "https://www.securityweek.com/in-other-news-attck-advisory-council-russian-cyberattacks-aid-missile-strikes-predator-bypasses-ios-indicators/",
      "pubDate": "2026-02-27T15:23:39.000Z",
      "description": "Other noteworthy stories that might have slipped under the radar: cyber valuations surge, OpenAI disrupts malicious AI use, ShinyHunters claims Odido breach. The post In Other News: ATT&#038;CK Advisory Council, Russian Cyberattacks Aid Missile Strikes, Predator Bypasses iOS Indicators appeared firs",
      "source": "SecurityWeek"
    },
    {
      "title": "Third-Party Patching and the Business Footprint We All Share",
      "link": "https://www.bleepingcomputer.com/news/security/third-party-patching-and-the-business-footprint-we-all-share/",
      "pubDate": "2026-02-27T15:00:10.000Z",
      "description": "Everyday tools like PDF readers, email clients, and archive utilities quietly define the real attack surface. Action1 explains how third-party software drift increases exploit risk and why consistent patching reduces exposure across endpoints. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "38 Million Allegedly Impacted by ManoMano Data Breach",
      "link": "https://www.securityweek.com/38-million-allegedly-impacted-by-manomano-data-breach/",
      "pubDate": "2026-02-27T13:41:27.000Z",
      "description": "Hackers stole personal information such as names, email addresses, phone numbers, and other information. The post 38 Million Allegedly Impacted by ManoMano Data Breach appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "900 Sangoma FreePBX Instances Infected With Web Shells",
      "link": "https://www.securityweek.com/900-sangoma-freepbx-instances-infected-with-web-shells/",
      "pubDate": "2026-02-27T13:24:25.000Z",
      "description": "The attacks exploited a post-authentication command injection vulnerability in the endpoint manager’s interface. The post 900 Sangoma FreePBX Instances Infected With Web Shells appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "ScarCruft Uses Zoho WorkDrive and USB Malware to Breach Air-Gapped Networks",
      "link": "https://thehackernews.com/2026/02/scarcruft-uses-zoho-workdrive-and-usb.html",
      "pubDate": "2026-02-27T12:43:00.000Z",
      "description": "The North Korean threat actor known as ScarCruft has been attributed to a fresh set of tools, including a backdoor that uses Zoho WorkDrive for command-and-control (C2) communications to fetch more payloads and an implant that uses removable media to relay commands and breach air-gapped networks. Th",
      "source": "The Hacker News"
    },
    {
      "title": "Juniper Networks PTX Routers Affected by Critical Vulnerability",
      "link": "https://www.securityweek.com/juniper-networks-ptx-routers-affected-by-critical-vulnerability/",
      "pubDate": "2026-02-27T10:39:18.000Z",
      "description": "An out-of-band security update for Junos OS Evolved patches the remote code execution vulnerability CVE-2026-21902. The post Juniper Networks PTX Routers Affected by Critical Vulnerability appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Previously harmless Google API keys now expose Gemini AI data",
      "link": "https://www.bleepingcomputer.com/news/security/previously-harmless-google-api-keys-now-expose-gemini-ai-data/",
      "pubDate": "2026-02-26T20:55:29.000Z",
      "description": "Google API keys for services like Maps embedded in accessible client-side code could be used to authenticate to the Gemini AI assistant and access private data. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "European DYI chain ManoMano data breach impacts 38 million customers",
      "link": "https://www.bleepingcomputer.com/news/security/european-dyi-chain-manomano-data-breach-impacts-38-million-customers/",
      "pubDate": "2026-02-26T17:35:21.000Z",
      "description": "DIY store chain ManoMano is notifying customers of a data breach personal data, which was caused by hackers compromising a third-party service provider. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Critical Juniper Networks PTX flaw allows full router takeover",
      "link": "https://www.bleepingcomputer.com/news/security/critical-juniper-networks-ptx-flaw-allows-full-router-takeover/",
      "pubDate": "2026-02-26T16:42:12.000Z",
      "description": "A critical vulnerability in the Junos OS Evolved network operating system running on PTX Series routers from Juniper Networks could allow an unauthenticated attacker to execute code remotely with root privileges. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Olympique Marseille confirms 'attempted' cyberattack after data leak",
      "link": "https://www.bleepingcomputer.com/news/security/olympique-marseille-football-club-confirms-cyberattack-after-data-leak/",
      "pubDate": "2026-02-26T16:11:30.000Z",
      "description": "French professional football club Olympique de Marseille has confirmed a cyberattack after a threat actor claimed on Monday that it breached the club's systems earlier this month. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Malicious StripeApi NuGet Package Mimicked Official Library and Stole API Tokens",
      "link": "https://thehackernews.com/2026/02/malicious-stripeapi-nuget-package.html",
      "pubDate": "2026-02-26T10:09:00.000Z",
      "description": "Cybersecurity researchers have disclosed details of a new malicious package discovered on the NuGet Gallery, impersonating a library from financial services firm Stripe in an attempt to target the financial sector. The package, codenamed StripeApi.Net, attempts to masquerade as Stripe.net, a legitim",
      "source": "The Hacker News"
    },
    {
      "title": "Cisco SD-WAN Zero-Day CVE-2026-20127 Exploited Since 2023 for Admin Access",
      "link": "https://thehackernews.com/2026/02/cisco-sd-wan-zero-day-cve-2026-20127.html",
      "pubDate": "2026-02-26T06:13:00.000Z",
      "description": "A newly disclosed maximum-severity security flaw in Cisco Catalyst SD-WAN Controller (formerly vSmart) and Catalyst SD-WAN Manager (formerly vManage) has come under active exploitation in the wild as part of malicious activity that dates back to 2023. The vulnerability, tracked as CVE-2026-20127 (CV",
      "source": "The Hacker News"
    },
    {
      "title": "Critical Cisco SD-WAN bug exploited in zero-day attacks since 2023",
      "link": "https://www.bleepingcomputer.com/news/security/critical-cisco-sd-wan-bug-exploited-in-zero-day-attacks-since-2023/",
      "pubDate": "2026-02-25T18:01:51.000Z",
      "description": "Cisco is warning that a critical authentication bypass vulnerability in Cisco Catalyst SD-WAN, tracked as CVE-2026-20127, was actively exploited in zero-day attacks that allowed remote attackers to compromise controllers and add malicious rogue peers to targeted networks. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Google Disrupts UNC2814 GRIDTIDE Campaign After 53 Breaches Across 42 Countries",
      "link": "https://thehackernews.com/2026/02/google-disrupts-unc2814-gridtide.html",
      "pubDate": "2026-02-25T17:46:00.000Z",
      "description": "Google on Wednesday disclosed that it worked with industry partners to disrupt the infrastructure of a suspected China-nexus cyber espionage group tracked as UNC2814 that breached at least 53 organizations across 42 countries. \"This prolific, elusive actor has a long history of targeting internation",
      "source": "The Hacker News"
    },
    {
      "title": "Chinese cyberspies breached dozens of telecom firms, govt agencies",
      "link": "https://www.bleepingcomputer.com/news/security/chinese-cyberspies-breached-dozens-of-telecom-firms-govt-agencies/",
      "pubDate": "2026-02-25T17:00:15.000Z",
      "description": "Google's Threat Intelligence Group (GTIG), Mandiant, and partners disrupted a global espionage campaign attributed to a suspected Chinese threat actor that used SaaS API calls to hide malicious traffic in attacks targeting telecom and government networks. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Claude Code Flaws Allow Remote Code Execution and API Key Exfiltration",
      "link": "https://thehackernews.com/2026/02/claude-code-flaws-allow-remote-code.html",
      "pubDate": "2026-02-25T17:00:00.000Z",
      "description": "Cybersecurity researchers have disclosed multiple security vulnerabilities in Anthropic's Claude Code, an artificial intelligence (AI)-powered coding assistant, that could result in remote code execution and theft of API credentials. \"The vulnerabilities exploit various configuration mechanisms, inc",
      "source": "The Hacker News"
    },
    {
      "title": "Defense Contractor Employee Jailed for Selling 8 Zero-Days to Russian Broker",
      "link": "https://thehackernews.com/2026/02/defense-contractor-employee-jailed-for.html",
      "pubDate": "2026-02-25T08:49:00.000Z",
      "description": "A 39-year-old Australian national who was previously employed at U.S. defense contractor L3Harris has been sentenced to a little over seven years in prison for selling eight zero-day exploits to Russian exploit broker Operation Zero in exchange for millions of dollars. Peter Williams pleaded guilty ",
      "source": "The Hacker News"
    },
    {
      "title": "SolarWinds Patches 4 Critical Serv-U 15.5 Flaws Allowing Root Code Execution",
      "link": "https://thehackernews.com/2026/02/solarwinds-patches-4-critical-serv-u.html",
      "pubDate": "2026-02-25T07:04:00.000Z",
      "description": "SolarWinds has released updates to address four critical security flaws in its Serv-U file transfer software that, if successfully exploited, could result in remote code execution. The vulnerabilities, all rated 9.1 on the CVSS scoring system, are listed below - CVE-2025-40538 - A broken access cont",
      "source": "The Hacker News"
    },
    {
      "title": "CISA Confirms Active Exploitation of FileZen CVE-2026-25108 Vulnerability",
      "link": "https://thehackernews.com/2026/02/cisa-confirms-active-exploitation-of.html",
      "pubDate": "2026-02-25T05:23:00.000Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added a recently disclosed vulnerability in FileZen to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation. The vulnerability, tracked as CVE-2026-25108 (CVSS v4 score: 8.7), is a case o",
      "source": "The Hacker News"
    }
  ]
}