{
  "lastUpdated": "2026-02-17T18:06:47.273Z",
  "itemCount": 20,
  "items": [
    {
      "title": "VulnCheck Raises $25 Million in Series B Funding to Scale Vulnerability Intelligence",
      "link": "https://www.securityweek.com/vulncheck-raises-25-million-in-series-b-funding-to-scale-vulnerability-intelligence/",
      "pubDate": "2026-02-17T16:00:04.000Z",
      "description": "The latest funding round was led by Sorenson Capital and brings the total investment to $45 million. The post VulnCheck Raises $25 Million in Series B Funding to Scale Vulnerability Intelligence appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "What 5 Million Apps Revealed About Secrets in JavaScript",
      "link": "https://www.bleepingcomputer.com/news/security/what-5-million-apps-revealed-about-secrets-in-javascript/",
      "pubDate": "2026-02-17T14:40:49.000Z",
      "description": "Leaked API keys are nothing new, but the scale of the problem in front-end code has been largely a mystery - until now. Intruder's research team built a new secrets detection method and scanned 5 million applications specifically looking for secrets hidden in JavaScript bundles. Here's what we learn",
      "source": "BleepingComputer"
    },
    {
      "title": "API Threats Grow in Scale as AI Expands the Blast Radius",
      "link": "https://www.securityweek.com/api-threats-grow-in-scale-as-ai-expands-the-blast-radius/",
      "pubDate": "2026-02-17T14:00:00.000Z",
      "description": "New research shows attackers increasingly abusing APIs at machine speed as AI-driven systems widen exposure and amplify impact. The post API Threats Grow in Scale as AI Expands the Blast Radius appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Webinar: How Modern SOC Teams Use AI and Context to Investigate Cloud Breaches Faster",
      "link": "https://thehackernews.com/2026/02/cloud-forensics-webinar-learn-how-ai.html",
      "pubDate": "2026-02-17T11:59:00.000Z",
      "description": "Cloud attacks move fast — faster than most incident response teams. In data centers, investigations had time. Teams could collect disk images, review logs, and build timelines over days. In the cloud, infrastructure is short-lived. A compromised instance can disappear in minutes. Identities rotate. ",
      "source": "The Hacker News"
    },
    {
      "title": "Poland arrests suspect linked to Phobos ransomware operation",
      "link": "https://www.bleepingcomputer.com/news/security/poland-arrests-suspect-linked-to-phobos-ransomware-operation/",
      "pubDate": "2026-02-17T11:31:37.000Z",
      "description": "Polish police have detained a 47-year-old man suspected of ties to the Phobos ransomware group and seized computers and mobile phones containing stolen credentials, credit card numbers, and server access data. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Eurail says stolen traveler data now up for sale on dark web",
      "link": "https://www.bleepingcomputer.com/news/security/eurail-says-stolen-traveler-data-now-up-for-sale-on-dark-web/",
      "pubDate": "2026-02-16T19:19:09.000Z",
      "description": "Eurail B.V., the operator that provides access to 250,000 kilometers of European railways, confirmed that data stolen in a breach earlier this year is being offered for sale on the dark web. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Man arrested for demanding reward after accidental police data leak",
      "link": "https://www.bleepingcomputer.com/news/security/man-arrested-for-demanding-reward-after-accidental-police-data-leak/",
      "pubDate": "2026-02-16T19:13:39.000Z",
      "description": "Dutch authorities arrested a 40-year-old man after he downloaded confidential documents that had been mistakenly shared by the police and refused to delete them unless he received \"something in return.\" [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Infostealer Steals OpenClaw AI Agent Configuration Files and Gateway Tokens",
      "link": "https://thehackernews.com/2026/02/infostealer-steals-openclaw-ai-agent.html",
      "pubDate": "2026-02-16T18:43:00.000Z",
      "description": "Cybersecurity researchers disclosed they have detected a case of an information stealer infection successfully exfiltrating a victim's OpenClaw (formerly Clawdbot and Moltbot) configuration environment. \"This finding marks a significant milestone in the evolution of infostealer behavior: the transit",
      "source": "The Hacker News"
    },
    {
      "title": "Infostealer malware found stealing OpenClaw secrets for first time",
      "link": "https://www.bleepingcomputer.com/news/security/infostealer-malware-found-stealing-openclaw-secrets-for-first-time/",
      "pubDate": "2026-02-16T17:32:26.000Z",
      "description": "With the massive adoption of the OpenClaw agentic AI assistant, information-stealing malware has been spotted stealing files associated with the framework that contain API keys, authentication tokens, and other secrets. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Dior, Louis Vuitton, Tiffany Fined $25 Million in South Korea After Data Breaches",
      "link": "https://www.securityweek.com/dior-louis-vuitton-tiffany-fined-25-million-in-south-korea-after-data-breaches/",
      "pubDate": "2026-02-16T15:09:13.000Z",
      "description": "Luxury brands were among the dozens of major companies whose Salesforce instances were targeted by Scattered LAPSUS$ Hunters. The post Dior, Louis Vuitton, Tiffany Fined $25 Million in South Korea After Data Breaches appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Weekly Recap: Outlook Add-Ins Hijack, 0-Day Patches, Wormable Botnet &amp; AI Malware",
      "link": "https://thehackernews.com/2026/02/weekly-recap-outlook-add-ins-hijack-0.html",
      "pubDate": "2026-02-16T12:55:00.000Z",
      "description": "This week’s recap shows how small gaps are turning into big entry points. Not always through new exploits, often through tools, add-ons, cloud setups, or workflows that people already trust and rarely question. Another signal: attackers are mixing old and new methods. Legacy botnet tactics, modern c",
      "source": "The Hacker News"
    },
    {
      "title": "CISA gives feds 3 days to patch actively exploited BeyondTrust flaw",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-feds-to-patch-beyondtrust-flaw-within-three-days/",
      "pubDate": "2026-02-16T12:33:11.000Z",
      "description": "CISA ordered U.S. government agencies on Friday to secure their BeyondTrust Remote Support instances against an actively exploited vulnerability within three days. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Safe and Inclusive E‑Society: How Lithuania Is Bracing for AI‑Driven Cyber Fraud",
      "link": "https://thehackernews.com/2026/02/safe-and-inclusive-esociety-how.html",
      "pubDate": "2026-02-16T11:55:00.000Z",
      "description": "Presentation of the KTU Consortium Mission ‘A Safe and Inclusive Digital Society’ at the Innovation Agency event ‘Innovation Breakfast: How Mission-Oriented Science and Innovation Programmes Will Address Societal Challenges’. Technologies are evolving fast, reshaping economies, governance, and daily",
      "source": "The Hacker News"
    },
    {
      "title": "Google patches first Chrome zero-day exploited in attacks this year",
      "link": "https://www.bleepingcomputer.com/news/security/google-patches-first-chrome-zero-day-exploited-in-attacks-this-year/",
      "pubDate": "2026-02-16T08:19:19.000Z",
      "description": "Google has released emergency updates to fix a high-severity Chrome vulnerability exploited in zero-day attacks, marking the first such security flaw patched since the start of the year. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "New Chrome Zero-Day (CVE-2026-2441) Under Active Attack — Patch Released",
      "link": "https://thehackernews.com/2026/02/new-chrome-zero-day-cve-2026-2441-under.html",
      "pubDate": "2026-02-16T06:38:00.000Z",
      "description": "Google on Friday released security updates for its Chrome browser to address a security flaw that it said has been exploited in the wild. The high-severity vulnerability, tracked as CVE-2026-2441 (CVSS score: 8.8), has been described as a use-after-free bug in CSS. Security researcher Shaheen Fazim ",
      "source": "The Hacker News"
    },
    {
      "title": "Researchers Observe In-the-Wild Exploitation of BeyondTrust CVSS 9.9 Vulnerability",
      "link": "https://thehackernews.com/2026/02/researchers-observe-in-wild.html",
      "pubDate": "2026-02-13T08:34:00.000Z",
      "description": "Threat actors have started to exploit a recently disclosed critical security flaw impacting BeyondTrust Remote Support (RS) and Privileged Remote Access (PRA) products, according to watchTowr. \"Overnight we observed first in-the-wild exploitation of BeyondTrust across our global sensors,\" Ryan Dewhu",
      "source": "The Hacker News"
    },
    {
      "title": "ThreatsDay Bulletin: AI Prompt RCE, Claude 0-Click, RenEngine Loader, Auto 0-Days &amp; 25+ Stories",
      "link": "https://thehackernews.com/2026/02/threatsday-bulletin-ai-prompt-rce.html",
      "pubDate": "2026-02-12T11:51:00.000Z",
      "description": "Threat activity this week shows one consistent signal — attackers are leaning harder on what already works. Instead of flashy new exploits, many operations are built around quiet misuse of trusted tools, familiar workflows, and overlooked exposures that sit in plain sight. Another shift is how acces",
      "source": "The Hacker News"
    },
    {
      "title": "83% of Ivanti EPMM Exploits Linked to Single IP on Bulletproof Hosting Infrastructure",
      "link": "https://thehackernews.com/2026/02/83-of-ivanti-epmm-exploits-linked-to.html",
      "pubDate": "2026-02-12T07:32:00.000Z",
      "description": "A significant chunk of the exploitation attempts targeting a newly disclosed security flaw in Ivanti Endpoint Manager Mobile (EPMM) can be traced back to a single IP address on bulletproof hosting infrastructure offered by PROSPERO. Threat intelligence firm GreyNoise said it recorded 417 exploitatio",
      "source": "The Hacker News"
    },
    {
      "title": "Apple Fixes Exploited Zero-Day Affecting iOS, macOS, and Other Devices",
      "link": "https://thehackernews.com/2026/02/apple-fixes-exploited-zero-day.html",
      "pubDate": "2026-02-12T05:39:00.000Z",
      "description": "Apple on Wednesday released iOS, iPadOS, macOS Tahoe, tvOS, watchOS, and visionOS updates to address a zero-day flaw that it said has been exploited in sophisticated cyber attacks. The vulnerability, tracked as CVE-2026-20700 (CVSS score: 7.8), has been described as a memory corruption issue in dyld",
      "source": "The Hacker News"
    },
    {
      "title": "First Malicious Outlook Add-In Found Stealing 4,000+ Microsoft Credentials",
      "link": "https://thehackernews.com/2026/02/first-malicious-outlook-add-in-found.html",
      "pubDate": "2026-02-11T17:45:00.000Z",
      "description": "Cybersecurity researchers have discovered what they said is the first known malicious Microsoft Outlook add-in detected in the wild. In this unusual supply chain attack detailed by Koi Security, an unknown attacker claimed the domain associated with a now-abandoned legitimate add-in to serve a fake ",
      "source": "The Hacker News"
    }
  ]
}