{
  "lastUpdated": "2026-02-19T06:16:40.434Z",
  "itemCount": 20,
  "items": [
    {
      "title": "Critical infra Honeywell CCTVs vulnerable to auth bypass flaw",
      "link": "https://www.bleepingcomputer.com/news/security/critical-infra-honeywell-cctvs-vulnerable-to-auth-bypass-flaw/",
      "pubDate": "2026-02-18T20:58:20.000Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) is warning of a critical vulnerability in multiple Honeywell CCTV products that allows unauthorized access to feeds or account hijacking. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Grandstream GXP1600 VoIP Phones Exposed to Unauthenticated Remote Code Execution",
      "link": "https://thehackernews.com/2026/02/grandstream-gxp1600-voip-phones-exposed.html",
      "pubDate": "2026-02-18T16:35:00.000Z",
      "description": "Cybersecurity researchers have disclosed a critical security flaw in the Grandstream GXP1600 series of VoIP phones that could allow an attacker to seize control of susceptible devices. The vulnerability, tracked as CVE-2026-2329, carries a CVSS score of 9.3 out of a maximum of 10.0. It has been desc",
      "source": "The Hacker News"
    },
    {
      "title": "Telegram channels expose rapid weaponization of SmarterMail flaws",
      "link": "https://www.bleepingcomputer.com/news/security/telegram-channels-expose-rapid-weaponization-of-smartermail-flaws/",
      "pubDate": "2026-02-18T16:27:38.000Z",
      "description": "Underground Telegram channels shared SmarterMail exploit PoCs and stolen admin credentials within days of disclosure. Flare explains how monitoring these communities reveals rapid weaponization of CVE-2026-24423 and CVE-2026-23760 tied to ransomware activity. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Microsoft: Anti-phishing rules mistakenly blocked emails, Teams messages",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-anti-phishing-rules-mistakenly-blocked-emails-teams-messages/",
      "pubDate": "2026-02-18T16:26:53.000Z",
      "description": "Microsoft says an Exchange Online issue that mistakenly quarantined legitimate emails last week was triggered by faulty heuristic detection rules designed to block credential phishing campaigns. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Cogent Security Raises $42 Million for AI-Driven Vulnerability Management",
      "link": "https://www.securityweek.com/cogent-security-raises-42-million-for-ai-driven-vulnerability-management/",
      "pubDate": "2026-02-18T14:47:07.000Z",
      "description": "The Series A funding round, led by Bain Capital, brings the total raised by Cogent to $53 million. The post Cogent Security Raises $42 Million for AI-Driven Vulnerability Management appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Data breach at fintech firm Figure affects nearly 1 million accounts",
      "link": "https://www.bleepingcomputer.com/news/security/data-breach-at-fintech-firm-figure-affects-nearly-1-million-accounts/",
      "pubDate": "2026-02-18T14:01:08.000Z",
      "description": "Hackers have stolen the personal and contact information of nearly 1 million accounts after breaching the systems of Figure Technology Solutions, a self-described blockchain-native financial technology company. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Vulnerabilities in Popular PDF Platforms Allowed Account Takeover, Data Exfiltration",
      "link": "https://www.securityweek.com/vulnerabilities-in-popular-pdf-platforms-allowed-account-takeover-data-exfiltration/",
      "pubDate": "2026-02-18T13:16:19.000Z",
      "description": "Novee researchers discovered 16 vulnerabilities in Foxit and Apryse PDF tools that could have been exploited via malicious documents or URLs. The post Vulnerabilities in Popular PDF Platforms Allowed Account Takeover, Data Exfiltration appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Critical Flaws Found in Four VS Code Extensions with Over 125 Million Installs",
      "link": "https://thehackernews.com/2026/02/critical-flaws-found-in-four-vs-code.html",
      "pubDate": "2026-02-18T13:16:00.000Z",
      "description": "Cybersecurity researchers have disclosed multiple security vulnerabilities in four popular Microsoft Visual Studio Code (VS Code) extensions that, if successfully exploited, could allow threat actors to steal local files and execute code remotely. The extensions, which have been collectively install",
      "source": "The Hacker News"
    },
    {
      "title": "Dell RecoverPoint for VMs Zero-Day CVE-2026-22769 Exploited Since Mid-2024",
      "link": "https://thehackernews.com/2026/02/dell-recoverpoint-for-vms-zero-day-cve.html",
      "pubDate": "2026-02-18T10:32:00.000Z",
      "description": "A maximum severity security vulnerability in Dell RecoverPoint for Virtual Machines has been exploited as a zero-day by a suspected China-nexus threat cluster dubbed UNC6201 since mid-2024, according to a new report from Google Mandiant and Google Threat Intelligence Group (GTIG). The activity invol",
      "source": "The Hacker News"
    },
    {
      "title": "CISA: Hackers Exploiting Vulnerability in Product of Taiwan Security Firm TeamT5",
      "link": "https://www.securityweek.com/cisa-hackers-exploiting-vulnerability-in-product-of-taiwan-security-firm-teamt5/",
      "pubDate": "2026-02-18T10:26:03.000Z",
      "description": "The vulnerability added to CISA’s KEV catalog affects ThreatSonar Anti-Ransomware and it was patched in 2024. The post CISA: Hackers Exploiting Vulnerability in Product of Taiwan Security Firm TeamT5 appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Palo Alto Networks to Acquire Koi in Reported $400 Million Transaction",
      "link": "https://www.securityweek.com/palo-alto-networks-to-acquire-koi-in-reported-400-million-transaction/",
      "pubDate": "2026-02-18T08:24:46.000Z",
      "description": "Koi has developed an endpoint security solution that Palo Alto will use to enhance its products. The post Palo Alto Networks to Acquire Koi in Reported $400 Million Transaction appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Notepad++ Fixes Hijacked Update Mechanism Used to Deliver Targeted Malware",
      "link": "https://thehackernews.com/2026/02/notepad-fixes-hijacked-update-mechanism.html",
      "pubDate": "2026-02-18T07:40:00.000Z",
      "description": "Notepad++ has released a security fix to plug gaps that were exploited by an advanced threat actor from China to hijack the software update mechanism to selectively deliver malware to targets of interest. The version 8.9.2 update incorporates what maintainer Don Ho calls a \"double lock\" design that ",
      "source": "The Hacker News"
    },
    {
      "title": "Dell RecoverPoint Zero-Day Exploited by Chinese Cyberespionage Group",
      "link": "https://www.securityweek.com/dell-recoverpoint-zero-day-exploited-by-chinese-cyberespionage-group/",
      "pubDate": "2026-02-18T07:09:01.000Z",
      "description": "GTIG and Mandiant said the zero-day tracked as CVE-2026-22769 has been exploited by UNC6201 since at least 2024. The post Dell RecoverPoint Zero-Day Exploited by Chinese Cyberespionage Group appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "CISA Flags Four Security Flaws Under Active Exploitation in Latest KEV Update",
      "link": "https://thehackernews.com/2026/02/cisa-flags-four-security-flaws-under.html",
      "pubDate": "2026-02-18T06:52:00.000Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild. The list of vulnerabilities is as follows - CVE-2026-2441 (CVSS score: 8.8) - A use-after-fr",
      "source": "The Hacker News"
    },
    {
      "title": "Flaws in popular VSCode extensions expose developers to attacks",
      "link": "https://www.bleepingcomputer.com/news/security/flaws-in-popular-vscode-extensions-expose-developers-to-attacks/",
      "pubDate": "2026-02-17T21:27:12.000Z",
      "description": "Vulnerabilities with high to critical severity ratings affecting popular Visual Studio Code (VSCode) extensions collectively downloaded more than 128 million times could be exploited to steal local files and execute code remotely. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Chinese hackers exploiting Dell zero-day flaw since mid-2024",
      "link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-exploiting-dell-zero-day-flaw-since-mid-2024/",
      "pubDate": "2026-02-17T20:15:03.000Z",
      "description": "A suspected Chinese state-backed hacking group has been quietly exploiting a critical Dell security flaw in zero-day attacks that started in mid-2024. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Webinar: How Modern SOC Teams Use AI and Context to Investigate Cloud Breaches Faster",
      "link": "https://thehackernews.com/2026/02/cloud-forensics-webinar-learn-how-ai.html",
      "pubDate": "2026-02-17T19:08:00.000Z",
      "description": "Cloud attacks move fast — faster than most incident response teams. In data centers, investigations had time. Teams could collect disk images, review logs, and build timelines over days. In the cloud, infrastructure is short-lived. A compromised instance can disappear in minutes. Identities rotate. ",
      "source": "The Hacker News"
    },
    {
      "title": "Notepad++ boosts update security with ‘double-lock’ mechanism",
      "link": "https://www.bleepingcomputer.com/news/security/notepad-plus-plus-boosts-update-security-with-double-lock-mechanism/",
      "pubDate": "2026-02-17T18:29:18.000Z",
      "description": "Notepad++ has adopted a \"double-lock\" design for its update mechanism to address recently exploited security gaps that resulted in a supply-chain compromise. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "VulnCheck Raises $25 Million in Series B Funding to Scale Vulnerability Intelligence",
      "link": "https://www.securityweek.com/vulncheck-raises-25-million-in-series-b-funding-to-scale-vulnerability-intelligence/",
      "pubDate": "2026-02-17T16:00:04.000Z",
      "description": "The latest funding round was led by Sorenson Capital and brings the total investment to $45 million. The post VulnCheck Raises $25 Million in Series B Funding to Scale Vulnerability Intelligence appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "What 5 Million Apps Revealed About Secrets in JavaScript",
      "link": "https://www.bleepingcomputer.com/news/security/what-5-million-apps-revealed-about-secrets-in-javascript/",
      "pubDate": "2026-02-17T14:40:49.000Z",
      "description": "Leaked API keys are nothing new, but the scale of the problem in front-end code has been largely a mystery - until now. Intruder's research team built a new secrets detection method and scanned 5 million applications specifically looking for secrets hidden in JavaScript bundles. Here's what we learn",
      "source": "BleepingComputer"
    }
  ]
}