{
  "lastUpdated": "2026-02-13T17:30:16.487Z",
  "itemCount": 20,
  "items": [
    {
      "title": "CISA flags critical Microsoft SCCM flaw as exploited in attacks",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-flags-microsoft-configmgr-rce-flaw-as-exploited-in-attacks/",
      "pubDate": "2026-02-13T12:35:09.000Z",
      "description": "CISA ordered federal agencies on Thursday to secure their systems against a critical Microsoft Configuration Manager vulnerability patched in October 2024 and now exploited in attacks. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Dutch Carrier Odido Discloses Data Breach Impacting 6 Million",
      "link": "https://www.securityweek.com/dutch-carrier-odido-discloses-data-breach-impacting-6-million/",
      "pubDate": "2026-02-13T12:02:20.000Z",
      "description": "Hackers stole personal information such as names, addresses, and phone numbers from a customer contact system. The post Dutch Carrier Odido Discloses Data Breach Impacting 6 Million appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "BeyondTrust Vulnerability Targeted by Hackers Within 24 Hours of PoC Release",
      "link": "https://www.securityweek.com/beyondtrust-vulnerability-targeted-by-hackers-within-24-hours-of-poc-release/",
      "pubDate": "2026-02-13T11:01:15.000Z",
      "description": "Exploitation attempts target CVE-2026-1731, a critical unauthenticated remote code execution flaw in BeyondTrust Remote Support. The post BeyondTrust Vulnerability Targeted by Hackers Within 24 Hours of PoC Release appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "CISA Warns of Exploited SolarWinds, Notepad++, Microsoft Vulnerabilities",
      "link": "https://www.securityweek.com/cisa-warns-of-exploited-solarwinds-notepad-microsoft-vulnerabilities/",
      "pubDate": "2026-02-13T10:36:04.000Z",
      "description": "Disclosed at the end of January, the SolarWinds vulnerability was likely exploited as a zero-day since December 2025. The post CISA Warns of Exploited SolarWinds, Notepad++, Microsoft Vulnerabilities appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Researchers Observe In-the-Wild Exploitation of BeyondTrust CVSS 9.9 Vulnerability",
      "link": "https://thehackernews.com/2026/02/researchers-observe-in-wild.html",
      "pubDate": "2026-02-13T08:34:00.000Z",
      "description": "Threat actors have started to exploit a recently disclosed critical security flaw impacting BeyondTrust Remote Support (RS) and Privileged Remote Access (PRA) products, according to watchTowr. \"Overnight we observed first in-the-wild exploitation of BeyondTrust across our global sensors,\" Ryan Dewhu",
      "source": "The Hacker News"
    },
    {
      "title": "China Revives Tianfu Cup Hacking Contest Under Increased Secrecy",
      "link": "https://www.securityweek.com/china-revives-tianfu-cup-hacking-contest-under-increased-secrecy/",
      "pubDate": "2026-02-13T06:49:26.000Z",
      "description": "Rewards for exploits are reportedly much smaller than in the contest’s glory days. The post China Revives Tianfu Cup Hacking Contest Under Increased Secrecy appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Critical BeyondTrust RCE flaw now exploited in attacks, patch now",
      "link": "https://www.bleepingcomputer.com/news/security/critical-beyondtrust-rce-flaw-now-exploited-in-attacks-patch-now/",
      "pubDate": "2026-02-12T21:34:12.000Z",
      "description": "A critical pre-authentication remote code execution vulnerability in BeyondTrust Remote Support and Privileged Remote Access appliances is now being exploited in attacks after a PoC was published online. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Odido data breach exposes personal info of 6.2 million customers",
      "link": "https://www.bleepingcomputer.com/news/security/odido-data-breach-exposes-personal-info-of-62-million-customers/",
      "pubDate": "2026-02-12T18:18:14.000Z",
      "description": "Dutch telecommunications provider Odido is warning that it suffered a cyberattack that reportedly exposed the personal data of 6.2 million customers. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "WordPress plugin with 900k installs vulnerable to critical RCE flaw",
      "link": "https://www.bleepingcomputer.com/news/security/wordpress-plugin-with-900k-installs-vulnerable-to-critical-rce-flaw/",
      "pubDate": "2026-02-12T17:09:41.000Z",
      "description": "A critical vulnerability in the WPvivid Backup & Migration plugin for WordPress, installed on more than 900,000 websites, can be exploited to achieve remote code execution by uploading arbitrary files without authentication. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "AMOS infostealer targets macOS through a popular AI app",
      "link": "https://www.bleepingcomputer.com/news/security/amos-infostealer-targets-macos-through-a-popular-ai-app/",
      "pubDate": "2026-02-12T14:25:38.000Z",
      "description": "AMOS infostealer is targeting macOS users by abusing popular AI apps and extension marketplaces to harvest credentials. Flare examines how AMOS operates, spreads through AI-driven lures, and feeds the broader stealer-log cybercrime economy. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Fake AI Chrome extensions with 300K users steal credentials, emails",
      "link": "https://www.bleepingcomputer.com/news/security/fake-ai-chrome-extensions-with-300k-users-steal-credentials-emails/",
      "pubDate": "2026-02-12T13:41:55.000Z",
      "description": "A set of 30 malicious Chrome extensions that have been installed by more than 300,000 users are masquerading as AI assistants to steal credentials, email content, and browsing information. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "ApolloMD Data Breach Impacts 626,000 Individuals",
      "link": "https://www.securityweek.com/apollomd-data-breach-impacts-626000-individuals/",
      "pubDate": "2026-02-12T12:23:33.000Z",
      "description": "The company says hackers stole the personal information of patients of affiliated physicians and practices. The post ApolloMD Data Breach Impacts 626,000 Individuals appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "ThreatsDay Bulletin: AI Prompt RCE, Claude 0-Click, RenEngine Loader, Auto 0-Days &amp; 25+ Stories",
      "link": "https://thehackernews.com/2026/02/threatsday-bulletin-ai-prompt-rce.html",
      "pubDate": "2026-02-12T11:51:00.000Z",
      "description": "Threat activity this week shows one consistent signal — attackers are leaning harder on what already works. Instead of flashy new exploits, many operations are built around quiet misuse of trusted tools, familiar workflows, and overlooked exposures that sit in plain sight. Another shift is how acces",
      "source": "The Hacker News"
    },
    {
      "title": "83% of Ivanti EPMM Exploits Linked to Single IP on Bulletproof Hosting Infrastructure",
      "link": "https://thehackernews.com/2026/02/83-of-ivanti-epmm-exploits-linked-to.html",
      "pubDate": "2026-02-12T07:32:00.000Z",
      "description": "A significant chunk of the exploitation attempts targeting a newly disclosed security flaw in Ivanti Endpoint Manager Mobile (EPMM) can be traced back to a single IP address on bulletproof hosting infrastructure offered by PROSPERO. Threat intelligence firm GreyNoise said it recorded 417 exploitatio",
      "source": "The Hacker News"
    },
    {
      "title": "Google says hackers are abusing Gemini AI for all attacks stages",
      "link": "https://www.bleepingcomputer.com/news/security/google-says-hackers-are-abusing-gemini-ai-for-all-attacks-stages/",
      "pubDate": "2026-02-12T07:00:00.000Z",
      "description": "Google Threat Intelligence Group (GTIG) has published a new report warning about AI model extraction/distillation attacks, in which private-sector firms and researchers use legitimate API access to systematically probe models and replicate their logic and reasoning. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Apple Fixes Exploited Zero-Day Affecting iOS, macOS, and Other Devices",
      "link": "https://thehackernews.com/2026/02/apple-fixes-exploited-zero-day.html",
      "pubDate": "2026-02-12T05:39:00.000Z",
      "description": "Apple on Wednesday released iOS, iPadOS, macOS Tahoe, tvOS, watchOS, and visionOS updates to address a zero-day flaw that it said has been exploited in sophisticated cyber attacks. The vulnerability, tracked as CVE-2026-20700 (CVSS score: 7.8), has been described as a memory corruption issue in dyld",
      "source": "The Hacker News"
    },
    {
      "title": "Apple fixes zero-day flaw used in 'extremely sophisticated' attacks",
      "link": "https://www.bleepingcomputer.com/news/security/apple-fixes-zero-day-flaw-used-in-extremely-sophisticated-attacks/",
      "pubDate": "2026-02-12T01:06:05.000Z",
      "description": "Apple has released security updates to fix a zero-day vulnerability that was exploited in an \"extremely sophisticated attack\" targeting specific individuals. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Windows 11 Notepad flaw let files execute silently via Markdown links",
      "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-notepad-flaw-let-files-execute-silently-via-markdown-links/",
      "pubDate": "2026-02-11T23:15:41.000Z",
      "description": "Microsoft has fixed a \"remote code execution\" vulnerability in Windows 11 Notepad that allowed attackers to execute local or remote programs by tricking users into clicking specially crafted Markdown links, without displaying any Windows security warnings. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "First Malicious Outlook Add-In Found Stealing 4,000+ Microsoft Credentials",
      "link": "https://thehackernews.com/2026/02/first-malicious-outlook-add-in-found.html",
      "pubDate": "2026-02-11T17:45:00.000Z",
      "description": "Cybersecurity researchers have discovered what they said is the first known malicious Microsoft Outlook add-in detected in the wild. In this unusual supply chain attack detailed by Koi Security, an unknown attacker claimed the domain associated with a now-abandoned legitimate add-in to serve a fake ",
      "source": "The Hacker News"
    },
    {
      "title": "Over 60 Software Vendors Issue Security Fixes Across OS, Cloud, and Network Platforms",
      "link": "https://thehackernews.com/2026/02/over-60-software-vendors-issue-security.html",
      "pubDate": "2026-02-11T13:28:00.000Z",
      "description": "It's Patch Tuesday, which means a number of software vendors have released patches for various security vulnerabilities impacting their products and services. Microsoft issued fixes for 59 flaws, including six actively exploited zero-days in various Windows components that could be abused to bypass ",
      "source": "The Hacker News"
    }
  ]
}