{
  "lastUpdated": "2026-02-23T23:09:05.491Z",
  "itemCount": 20,
  "items": [
    {
      "title": "Android mental health apps with 14.7M installs filled with security flaws",
      "link": "https://www.bleepingcomputer.com/news/security/android-mental-health-apps-with-147m-installs-filled-with-security-flaws/",
      "pubDate": "2026-02-23T22:59:04.000Z",
      "description": "Several mental health mobile apps with millions of downloads on Google Play contain security vulnerabilities that could expose users' sensitive medical information. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "APT28 Targeted European Entities Using Webhook-Based Macro Malware",
      "link": "https://thehackernews.com/2026/02/apt28-targeted-european-entities-using.html",
      "pubDate": "2026-02-23T19:41:00.000Z",
      "description": "The Russia-linked state-sponsored threat actor tracked as APT28 has been attributed to a new campaign targeting specific entities in Western and Central Europe. The activity, per S2 Grupo's LAB52 threat intelligence team, was active between September 2025 and January 2026. It has been codenamed Oper",
      "source": "The Hacker News"
    },
    {
      "title": "Ad tech firm Optimizely confirms data breach after vishing attack",
      "link": "https://www.bleepingcomputer.com/news/security/ad-tech-firm-optimizely-confirms-data-breach-after-vishing-attack/",
      "pubDate": "2026-02-23T18:04:01.000Z",
      "description": "New York-based ad tech company Optimizely has notified an undisclosed number of customers of a data breach after threat actors compromised some of its systems in a voice phishing attack. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Wormable XMRig Campaign Uses BYOVD Exploit and Time-Based Logic Bomb",
      "link": "https://thehackernews.com/2026/02/wormable-xmrig-campaign-uses-byovd.html",
      "pubDate": "2026-02-23T17:59:00.000Z",
      "description": "Cybersecurity researchers have disclosed details of a new cryptojacking campaign that uses pirated software bundles as lures to deploy a bespoke XMRig miner program on compromised hosts. \"Analysis of the recovered dropper, persistence triggers, and mining payload reveals a sophisticated, multi-stage",
      "source": "The Hacker News"
    },
    {
      "title": "US Healthcare Diagnostic Firm Says 140,000 Affected by Data Breach",
      "link": "https://www.securityweek.com/us-healthcare-diagnostic-firm-says-140000-affected-by-data-breach/",
      "pubDate": "2026-02-23T15:35:32.000Z",
      "description": "The Everest ransomware group has taken credit for a hacker attack on Vikor Scientific, now called Vanta Diagnostics. The post US Healthcare Diagnostic Firm Says 140,000 Affected by Data Breach appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "When identity isn’t the weak link, access still is",
      "link": "https://www.bleepingcomputer.com/news/security/when-identity-isnt-the-weak-link-access-still-is/",
      "pubDate": "2026-02-23T15:00:10.000Z",
      "description": "Stolen tokens and compromised devices let attackers reuse trust without breaking authentication. Specops Software explains why identity alone isn't enough and how continuous device verification strengthens Zero Trust. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "How Exposed Endpoints Increase Risk Across LLM Infrastructure",
      "link": "https://thehackernews.com/2026/02/how-exposed-endpoints-increase-risk.html",
      "pubDate": "2026-02-23T11:58:00.000Z",
      "description": "As more organizations run their own Large Language Models (LLMs), they are also deploying more internal services and Application Programming Interfaces (APIs) to support those models. Modern security risks are being introduced less from the models themselves and more from the infrastructure that ser",
      "source": "The Hacker News"
    },
    {
      "title": "CISA: Recently patched RoundCube flaws now exploited in attacks",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-recently-patched-roundcube-flaws-now-exploited-in-attacks/",
      "pubDate": "2026-02-23T11:44:21.000Z",
      "description": "CISA flagged two Roundcube Webmail vulnerabilities as actively exploited in attacks and ordered U.S. federal agencies to patch them within three weeks. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Hundreds of FortiGate Firewalls Hacked in AI-Powered Attacks: AWS",
      "link": "https://www.securityweek.com/hundreds-of-fortigate-firewalls-hacked-in-ai-powered-attacks-aws/",
      "pubDate": "2026-02-23T11:34:35.000Z",
      "description": "Threat actors relying on AI have been exploiting exposed ports and weak credentials to take over FortiGate devices. The post Hundreds of FortiGate Firewalls Hacked in AI-Powered Attacks: AWS appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Recent RoundCube Webmail Vulnerability Exploited in Attacks",
      "link": "https://www.securityweek.com/recent-roundcube-webmail-vulnerability-exploited-in-attacks/",
      "pubDate": "2026-02-23T10:47:45.000Z",
      "description": "Patched in December 2025, the exploited flaw leads to XSS attacks via the animate tags in SVG documents. The post Recent RoundCube Webmail Vulnerability Exploited in Attacks appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Malicious npm Packages Harvest Crypto Keys, CI Secrets, and API Tokens",
      "link": "https://thehackernews.com/2026/02/malicious-npm-packages-harvest-crypto.html",
      "pubDate": "2026-02-23T10:20:00.000Z",
      "description": "Cybersecurity researchers have disclosed what they say is an active \"Shai-Hulud-like\" supply chain worm campaign that has leveraged a cluster of at least 19 malicious npm packages to enable credential harvesting and cryptocurrency key theft. The campaign has been codenamed SANDWORM_MODE by supply ch",
      "source": "The Hacker News"
    },
    {
      "title": "PayPal Data Breach Led to Fraudulent Transactions",
      "link": "https://www.securityweek.com/paypal-data-breach-led-to-fraudulent-transactions/",
      "pubDate": "2026-02-23T09:13:25.000Z",
      "description": "PayPal blamed an application error for the exposure of customer personal information for nearly 6 months. The post PayPal Data Breach Led to Fraudulent Transactions appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Amazon: AI-assisted hacker breached 600 Fortinet firewalls in 5 weeks",
      "link": "https://www.bleepingcomputer.com/news/security/amazon-ai-assisted-hacker-breached-600-fortigate-firewalls-in-5-weeks/",
      "pubDate": "2026-02-21T13:50:58.000Z",
      "description": "Amazon is warning that a Russian-speaking hacker used multiple generative AI services as part of a campaign that breached more than 600 FortiGate firewalls across 55 countries in five weeks. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Critical Grandstream Phone Vulnerability Exposes Calls to Interception",
      "link": "https://www.securityweek.com/critical-grandstream-phone-vulnerability-exposes-calls-to-interception/",
      "pubDate": "2026-02-21T12:00:00.000Z",
      "description": "The flaw tracked as CVE-2026-2329 can be exploited without authentication for remote code execution with root privileges. The post Critical Grandstream Phone Vulnerability Exposes Calls to Interception appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Anthropic Launches Claude Code Security for AI-Powered Vulnerability Scanning",
      "link": "https://thehackernews.com/2026/02/anthropic-launches-claude-code-security.html",
      "pubDate": "2026-02-21T07:58:00.000Z",
      "description": "Artificial intelligence (AI) company Anthropic has begun to roll out a new security feature for Claude Code that can scan a user's software codebase for vulnerabilities and suggest patches. The capability, called Claude Code Security, is currently available in a limited research preview to Enterpris",
      "source": "The Hacker News"
    },
    {
      "title": "CISA Adds Two Actively Exploited Roundcube Flaws to KEV Catalog",
      "link": "https://thehackernews.com/2026/02/cisa-adds-two-actively-exploited.html",
      "pubDate": "2026-02-21T07:21:00.000Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added two security flaws impacting Roundcube webmail software to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation. The vulnerabilities in question are listed below - CVE-2025-49113 (CV",
      "source": "The Hacker News"
    },
    {
      "title": "EC-Council Expands AI Certification Portfolio to Strengthen U.S. AI Workforce Readiness and Security",
      "link": "https://thehackernews.com/2026/02/ec-council-expands-ai-certification.html",
      "pubDate": "2026-02-21T04:30:00.000Z",
      "description": "With $5.5 trillion in global AI risk exposure and 700,000 U.S. workers needing reskilling, four new AI certifications and Certified CISO v4 help close the gap between AI adoption and workforce readiness. EC-Council, creator of the world-renowned Certified Ethical Hacker (CEH) credential and a global",
      "source": "The Hacker News"
    },
    {
      "title": "CISA: BeyondTrust RCE flaw now exploited in ransomware attacks",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-beyondtrust-rce-flaw-now-exploited-in-ransomware-attacks/",
      "pubDate": "2026-02-20T17:02:25.000Z",
      "description": "Hackers are actively exploiting the CVE-2026-1731 vulnerability in the BeyondTrust Remote Support product, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) warns. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Data breach at French bank registry impacts 1.2 million accounts",
      "link": "https://www.bleepingcomputer.com/news/security/data-breach-at-french-bank-registry-impacts-12-million-accounts/",
      "pubDate": "2026-02-20T16:20:40.000Z",
      "description": "The French Ministry of Finance has published an announcement informing of a cybersecurity incident that has impacted 1.2 million accounts. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "BeyondTrust Flaw Used for Web Shells, Backdoors, and Data Exfiltration",
      "link": "https://thehackernews.com/2026/02/beyondtrust-flaw-used-for-web-shells.html",
      "pubDate": "2026-02-20T15:45:00.000Z",
      "description": "Threat actors have been observed exploiting a recently disclosed critical security flaw impacting BeyondTrust Remote Support (RS) and Privileged Remote Access (PRA) products to conduct a wide range of malicious actions, including deploying VShell and The vulnerability, tracked as CVE-2026-1731 (CVSS",
      "source": "The Hacker News"
    }
  ]
}