{
  "lastUpdated": "2026-02-18T11:26:16.437Z",
  "itemCount": 20,
  "items": [
    {
      "title": "CISA: Hackers Exploiting Vulnerability in Product of Taiwan Security Firm TeamT5",
      "link": "https://www.securityweek.com/cisa-hackers-exploiting-vulnerability-in-product-of-taiwan-security-firm-teamt5/",
      "pubDate": "2026-02-18T10:26:03.000Z",
      "description": "The vulnerability added to CISA’s KEV catalog affects ThreatSonar Anti-Ransomware and it was patched in 2024. The post CISA: Hackers Exploiting Vulnerability in Product of Taiwan Security Firm TeamT5 appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Palo Alto Networks to Acquire Koi in Reported $400 Million Transaction",
      "link": "https://www.securityweek.com/palo-alto-networks-to-acquire-koi-in-reported-400-million-transaction/",
      "pubDate": "2026-02-18T08:24:46.000Z",
      "description": "Koi has developed an endpoint security solution that Palo Alto will use to enhance its products. The post Palo Alto Networks to Acquire Koi in Reported $400 Million Transaction appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Notepad++ Fixes Hijacked Update Mechanism Used to Deliver Targeted Malware",
      "link": "https://thehackernews.com/2026/02/notepad-fixes-hijacked-update-mechanism.html",
      "pubDate": "2026-02-18T07:40:00.000Z",
      "description": "Notepad++ has released a security fix to plug gaps that were exploited by an advanced threat actor from China to hijack the software update mechanism to selectively deliver malware to targets of interest. The version 8.9.2 update incorporates what maintainer Don Ho calls a \"double lock\" design that ",
      "source": "The Hacker News"
    },
    {
      "title": "Dell RecoverPoint Zero-Day Exploited by Chinese Cyberespionage Group",
      "link": "https://www.securityweek.com/dell-recoverpoint-zero-day-exploited-by-chinese-cyberespionage-group/",
      "pubDate": "2026-02-18T07:09:01.000Z",
      "description": "GTIG and Mandiant said the zero-day tracked as CVE-2026-22769 has been exploited by UNC6201 since at least 2024. The post Dell RecoverPoint Zero-Day Exploited by Chinese Cyberespionage Group appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "CISA Flags Four Security Flaws Under Active Exploitation in Latest KEV Update",
      "link": "https://thehackernews.com/2026/02/cisa-flags-four-security-flaws-under.html",
      "pubDate": "2026-02-18T06:52:00.000Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild. The list of vulnerabilities is as follows - CVE-2026-2441 (CVSS score: 8.8) - A use-after-fr",
      "source": "The Hacker News"
    },
    {
      "title": "Flaws in popular VSCode extensions expose developers to attacks",
      "link": "https://www.bleepingcomputer.com/news/security/flaws-in-popular-vscode-extensions-expose-developers-to-attacks/",
      "pubDate": "2026-02-17T21:27:12.000Z",
      "description": "Vulnerabilities with high to critical severity ratings affecting popular Visual Studio Code (VSCode) extensions collectively downloaded more than 128 million times could be exploited to steal local files and execute code remotely. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Chinese hackers exploiting Dell zero-day flaw since mid-2024",
      "link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-exploiting-dell-zero-day-flaw-since-mid-2024/",
      "pubDate": "2026-02-17T20:15:03.000Z",
      "description": "A suspected Chinese state-backed hacking group has been quietly exploiting a critical Dell security flaw in zero-day attacks that started in mid-2024. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Webinar: How Modern SOC Teams Use AI and Context to Investigate Cloud Breaches Faster",
      "link": "https://thehackernews.com/2026/02/cloud-forensics-webinar-learn-how-ai.html",
      "pubDate": "2026-02-17T19:08:00.000Z",
      "description": "Cloud attacks move fast — faster than most incident response teams. In data centers, investigations had time. Teams could collect disk images, review logs, and build timelines over days. In the cloud, infrastructure is short-lived. A compromised instance can disappear in minutes. Identities rotate. ",
      "source": "The Hacker News"
    },
    {
      "title": "Notepad++ boosts update security with ‘double-lock’ mechanism",
      "link": "https://www.bleepingcomputer.com/news/security/notepad-plus-plus-boosts-update-security-with-double-lock-mechanism/",
      "pubDate": "2026-02-17T18:29:18.000Z",
      "description": "Notepad++ has adopted a \"double-lock\" design for its update mechanism to address recently exploited security gaps that resulted in a supply-chain compromise. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "VulnCheck Raises $25 Million in Series B Funding to Scale Vulnerability Intelligence",
      "link": "https://www.securityweek.com/vulncheck-raises-25-million-in-series-b-funding-to-scale-vulnerability-intelligence/",
      "pubDate": "2026-02-17T16:00:04.000Z",
      "description": "The latest funding round was led by Sorenson Capital and brings the total investment to $45 million. The post VulnCheck Raises $25 Million in Series B Funding to Scale Vulnerability Intelligence appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "What 5 Million Apps Revealed About Secrets in JavaScript",
      "link": "https://www.bleepingcomputer.com/news/security/what-5-million-apps-revealed-about-secrets-in-javascript/",
      "pubDate": "2026-02-17T14:40:49.000Z",
      "description": "Leaked API keys are nothing new, but the scale of the problem in front-end code has been largely a mystery - until now. Intruder's research team built a new secrets detection method and scanned 5 million applications specifically looking for secrets hidden in JavaScript bundles. Here's what we learn",
      "source": "BleepingComputer"
    },
    {
      "title": "API Threats Grow in Scale as AI Expands the Blast Radius",
      "link": "https://www.securityweek.com/api-threats-grow-in-scale-as-ai-expands-the-blast-radius/",
      "pubDate": "2026-02-17T14:00:00.000Z",
      "description": "New research shows attackers increasingly abusing APIs at machine speed as AI-driven systems widen exposure and amplify impact. The post API Threats Grow in Scale as AI Expands the Blast Radius appeared first on SecurityWeek.",
      "source": "SecurityWeek"
    },
    {
      "title": "Poland arrests suspect linked to Phobos ransomware operation",
      "link": "https://www.bleepingcomputer.com/news/security/poland-arrests-suspect-linked-to-phobos-ransomware-operation/",
      "pubDate": "2026-02-17T11:31:37.000Z",
      "description": "Polish police have detained a 47-year-old man suspected of ties to the Phobos ransomware group and seized computers and mobile phones containing stolen credentials, credit card numbers, and server access data. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Eurail says stolen traveler data now up for sale on dark web",
      "link": "https://www.bleepingcomputer.com/news/security/eurail-says-stolen-traveler-data-now-up-for-sale-on-dark-web/",
      "pubDate": "2026-02-16T19:19:09.000Z",
      "description": "Eurail B.V., the operator that provides access to 250,000 kilometers of European railways, confirmed that data stolen in a breach earlier this year is being offered for sale on the dark web. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Man arrested for demanding reward after accidental police data leak",
      "link": "https://www.bleepingcomputer.com/news/security/man-arrested-for-demanding-reward-after-accidental-police-data-leak/",
      "pubDate": "2026-02-16T19:13:39.000Z",
      "description": "Dutch authorities arrested a 40-year-old man after he downloaded confidential documents that had been mistakenly shared by the police and refused to delete them unless he received \"something in return.\" [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Infostealer Steals OpenClaw AI Agent Configuration Files and Gateway Tokens",
      "link": "https://thehackernews.com/2026/02/infostealer-steals-openclaw-ai-agent.html",
      "pubDate": "2026-02-16T18:43:00.000Z",
      "description": "Cybersecurity researchers disclosed they have detected a case of an information stealer infection successfully exfiltrating a victim's OpenClaw (formerly Clawdbot and Moltbot) configuration environment. \"This finding marks a significant milestone in the evolution of infostealer behavior: the transit",
      "source": "The Hacker News"
    },
    {
      "title": "Infostealer malware found stealing OpenClaw secrets for first time",
      "link": "https://www.bleepingcomputer.com/news/security/infostealer-malware-found-stealing-openclaw-secrets-for-first-time/",
      "pubDate": "2026-02-16T17:32:26.000Z",
      "description": "With the massive adoption of the OpenClaw agentic AI assistant, information-stealing malware has been spotted stealing files associated with the framework that contain API keys, authentication tokens, and other secrets. [...]",
      "source": "BleepingComputer"
    },
    {
      "title": "Weekly Recap: Outlook Add-Ins Hijack, 0-Day Patches, Wormable Botnet &amp; AI Malware",
      "link": "https://thehackernews.com/2026/02/weekly-recap-outlook-add-ins-hijack-0.html",
      "pubDate": "2026-02-16T12:55:00.000Z",
      "description": "This week’s recap shows how small gaps are turning into big entry points. Not always through new exploits, often through tools, add-ons, cloud setups, or workflows that people already trust and rarely question. Another signal: attackers are mixing old and new methods. Legacy botnet tactics, modern c",
      "source": "The Hacker News"
    },
    {
      "title": "Safe and Inclusive E‑Society: How Lithuania Is Bracing for AI‑Driven Cyber Fraud",
      "link": "https://thehackernews.com/2026/02/safe-and-inclusive-esociety-how.html",
      "pubDate": "2026-02-16T11:55:00.000Z",
      "description": "Presentation of the KTU Consortium Mission ‘A Safe and Inclusive Digital Society’ at the Innovation Agency event ‘Innovation Breakfast: How Mission-Oriented Science and Innovation Programmes Will Address Societal Challenges’. Technologies are evolving fast, reshaping economies, governance, and daily",
      "source": "The Hacker News"
    },
    {
      "title": "New Chrome Zero-Day (CVE-2026-2441) Under Active Attack — Patch Released",
      "link": "https://thehackernews.com/2026/02/new-chrome-zero-day-cve-2026-2441-under.html",
      "pubDate": "2026-02-16T06:38:00.000Z",
      "description": "Google on Friday released security updates for its Chrome browser to address a security flaw that it said has been exploited in the wild. The high-severity vulnerability, tracked as CVE-2026-2441 (CVSS score: 8.8), has been described as a use-after-free bug in CSS. Security researcher Shaheen Fazim ",
      "source": "The Hacker News"
    }
  ]
}